## mesazon-clusters-dev
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
module.gateway_pg_cluster.digitalocean_database_cluster.pg_cluster: Refreshing state... [id=f0e51974-e6df-4ab5-84e5-440a47451320]
module.gateway_pg_cluster.digitalocean_database_db.pg_db: Refreshing state... [id=f0e51974-e6df-4ab5-84e5-440a47451320/database/gateway_db]
module.gateway_pg_configure.digitalocean_database_user.flyway_user: Refreshing state... [id=f0e51974-e6df-4ab5-84e5-440a47451320/user/gateway_flyway_user]
module.gateway_pg_configure.digitalocean_database_user.database_user: Refreshing state... [id=f0e51974-e6df-4ab5-84e5-440a47451320/user/gateway]
module.gateway_pg_cluster.digitalocean_database_postgresql_config.pg_config: Refreshing state... [id=f0e51974-e6df-4ab5-84e5-440a47451320/postgresql-config]
module.gateway_pg_cluster.digitalocean_database_connection_pool.pg_pool: Refreshing state... [id=f0e51974-e6df-4ab5-84e5-440a47451320/gateway-pool-01]
module.gateway_pg_configure.postgresql_role.user_group: Refreshing state... [id=gateway_group]
module.gateway_pg_configure.postgresql_role.flyway_group: Refreshing state... [id=gateway_flyway_group]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.gateway_pg_cluster.digitalocean_database_cluster.pg_cluster has been deleted
  - resource "digitalocean_database_cluster" "pg_cluster" {
      - host                 = "gateway-fra1-mesazon-dev-do-user-26186808-0.h.db.ondigitalocean.com" -> null
      - id                   = "f0e51974-e6df-4ab5-84e5-440a47451320" -> null
        name                 = "gateway-fra1-mesazon-dev"
      - password             = (sensitive value) -> null
      - port                 = 25060 -> null
        tags                 = [
            "mesazon-dev",
        ]
      - user                 = "doadmin" -> null
        # (14 unchanged attributes hidden)
    }

  # module.gateway_pg_cluster.digitalocean_database_db.pg_db has been deleted
  - resource "digitalocean_database_db" "pg_db" {
        id         = "f0e51974-e6df-4ab5-84e5-440a47451320/database/gateway_db"
      - name       = "gateway_db" -> null
        # (1 unchanged attribute hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.gateway_pg_cluster.digitalocean_database_cluster.pg_cluster will be created
  + resource "digitalocean_database_cluster" "pg_cluster" {
      + database             = (known after apply)
      + engine               = "pg"
      + host                 = (known after apply)
      + id                   = (known after apply)
      + metrics_endpoints    = (known after apply)
      + name                 = "gateway-fra1-mesazon-dev"
      + node_count           = 1
      + password             = (sensitive value)
      + port                 = (known after apply)
      + private_host         = (known after apply)
      + private_network_uuid = (known after apply)
      + private_uri          = (sensitive value)
      + project_id           = "8a8c246e-2057-46b7-a01a-04cbbbf0b8d9"
      + region               = "fra1"
      + size                 = "db-s-1vcpu-1gb"
      + storage_size_mib     = (known after apply)
      + tags                 = [
          + "mesazon-dev",
        ]
      + ui_database          = (known after apply)
      + ui_host              = (known after apply)
      + ui_password          = (sensitive value)
      + ui_port              = (known after apply)
      + ui_uri               = (sensitive value)
      + ui_user              = (known after apply)
      + uri                  = (sensitive value)
      + urn                  = (known after apply)
      + user                 = (known after apply)
      + version              = "18"
    }

  # module.gateway_pg_cluster.digitalocean_database_connection_pool.pg_pool will be created
  + resource "digitalocean_database_connection_pool" "pg_pool" {
      + cluster_id   = (known after apply)
      + db_name      = "gateway_db"
      + host         = (known after apply)
      + id           = (known after apply)
      + mode         = "transaction"
      + name         = "gateway-pool-01"
      + password     = (sensitive value)
      + port         = (known after apply)
      + private_host = (known after apply)
      + private_uri  = (sensitive value)
      + size         = 10
      + uri          = (sensitive value)
      + user         = (known after apply)
    }

  # module.gateway_pg_cluster.digitalocean_database_db.pg_db will be created
  + resource "digitalocean_database_db" "pg_db" {
      + cluster_id = (known after apply)
      + id         = (known after apply)
      + name       = "gateway_db"
    }

  # module.gateway_pg_cluster.digitalocean_database_postgresql_config.pg_config will be created
  + resource "digitalocean_database_postgresql_config" "pg_config" {
      + autovacuum_analyze_scale_factor     = (known after apply)
      + autovacuum_analyze_threshold        = (known after apply)
      + autovacuum_freeze_max_age           = (known after apply)
      + autovacuum_max_workers              = (known after apply)
      + autovacuum_naptime                  = (known after apply)
      + autovacuum_vacuum_cost_delay        = (known after apply)
      + autovacuum_vacuum_cost_limit        = (known after apply)
      + autovacuum_vacuum_scale_factor      = (known after apply)
      + autovacuum_vacuum_threshold         = (known after apply)
      + backup_hour                         = (known after apply)
      + backup_minute                       = (known after apply)
      + bgwriter_delay                      = (known after apply)
      + bgwriter_flush_after                = (known after apply)
      + bgwriter_lru_maxpages               = (known after apply)
      + bgwriter_lru_multiplier             = (known after apply)
      + cluster_id                          = (known after apply)
      + deadlock_timeout                    = (known after apply)
      + default_toast_compression           = (known after apply)
      + id                                  = (known after apply)
      + idle_in_transaction_session_timeout = 60000
      + jit                                 = (known after apply)
      + log_autovacuum_min_duration         = (known after apply)
      + log_error_verbosity                 = (known after apply)
      + log_line_prefix                     = (known after apply)
      + log_min_duration_statement          = 1000
      + max_files_per_process               = (known after apply)
      + max_locks_per_transaction           = (known after apply)
      + max_logical_replication_workers     = (known after apply)
      + max_parallel_workers                = (known after apply)
      + max_parallel_workers_per_gather     = (known after apply)
      + max_pred_locks_per_transaction      = (known after apply)
      + max_prepared_transactions           = (known after apply)
      + max_replication_slots               = (known after apply)
      + max_stack_depth                     = (known after apply)
      + max_standby_archive_delay           = (known after apply)
      + max_standby_streaming_delay         = (known after apply)
      + max_wal_senders                     = (known after apply)
      + max_worker_processes                = (known after apply)
      + pg_partman_bgw_interval             = (known after apply)
      + pg_partman_bgw_role                 = (known after apply)
      + pg_stat_statements_track            = (known after apply)
      + shared_buffers_percentage           = (known after apply)
      + temp_file_limit                     = (known after apply)
      + timezone                            = "UTC"
      + track_activity_query_size           = (known after apply)
      + track_commit_timestamp              = (known after apply)
      + track_functions                     = (known after apply)
      + track_io_timing                     = (known after apply)
      + wal_sender_timeout                  = (known after apply)
      + wal_writer_delay                    = (known after apply)
      + work_mem                            = (known after apply)

      + pgbouncer (known after apply)

      + timescaledb (known after apply)
    }

  # module.gateway_pg_configure.digitalocean_database_user.database_user will be created
  + resource "digitalocean_database_user" "database_user" {
      + access_cert = (sensitive value)
      + access_key  = (sensitive value)
      + cluster_id  = (known after apply)
      + id          = (known after apply)
      + name        = "gateway"
      + password    = (sensitive value)
      + role        = (known after apply)
    }

  # module.gateway_pg_configure.digitalocean_database_user.flyway_user will be created
  + resource "digitalocean_database_user" "flyway_user" {
      + access_cert = (sensitive value)
      + access_key  = (sensitive value)
      + cluster_id  = (known after apply)
      + id          = (known after apply)
      + name        = "gateway_flyway_user"
      + password    = (sensitive value)
      + role        = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

```

</details>